{
  "downloaded": {
    "DTnzdKij9aV": {
      "account": "@nuatlantis",
      "downloaded_at": "2026-01-19T13:14:29.808887",
      "metadata": {
        "caption": "Comment “POWER” to learn what has been hidden from the public for the last 150 years\n\nStep into your power. Don’t hide away. \n\n5G, wifi, heavy metals, fluoride, chemtrails, shots, pesticides, herbicides, GMO’s, \n\nHas nothing on the human biofield. \n\nOnce you realize the “powers that where” are more like pest then anything else you begin to see them for what they really are and begin to see yourself for what YOU REALLY ARE. \n\nFrom mind control to toxic environments, every measure is being used to keep you from realizing the truth of this planet, the cosmos, and most importantly the truth of who and what you really are. \n\nA truth so dangerous that if realized their entire show would be over in an instant.\n\nIf you’re ready to learn comment “POWER” to sign up for my Biofield Mastery Training\n\nCurrently on sale for a LIMITED TIME ONLY",
        "likes": 1423,
        "comments": 276,
        "views": 9391,
        "date": "2026-01-17T13:48:47-05:00",
        "url": "https://www.instagram.com/p/DTnzdKij9aV/",
        "shortcode": "DTnzdKij9aV"
      }
    },
    "DTs6RdiD0zQ": {
      "account": "@nuatlantis",
      "downloaded_at": "2026-01-24T09:50:36.649086",
      "metadata": {
        "caption": "Comment “Aura” if you want to learn how to activate your energy system which has been hidden from the greater public for over a century. \n\nYou were conditioned from birth to take the miracle of life for granted.\n\nWe all where \n\nIf you had any idea of what your body actually is designed to do and what its true capabilities are you would never have a doubt about your potential or worth again\n\nToday most people treat their own body like a burden or ignore it entirely.\n\nAfter generations of separation from nature and from our own biology, we’ve reached a point where we consider the natural as supernatural fantasy and embrace inorganic technology over our own organic super technology from which the former was modeled after. \n\nWe celebrate the copy and laugh at the original…\n\nWe believe in wifi more than we believe in our own abilities to wirelessly receive and transmit thought signals even though the operations and concept is exactly the same\n\nAs if “awakening” is a spiritual concept and not a human ability within us all..\n\nIt wasn’t always like this, at one point in our forgotten history we where so close to the truth we could taste it \n\nElectrotherapy, magnetic medicine, vibrational physics—once openly studied at the top learning institutions in the country—were erased, labeled “fringe,” and buried when they challenged centralized control.\n\nIt’s hard to sell dependence when people understand the body as a living electromagnetic self-regenerating system.\n\nAnd it would be nearly impossible to push a fully wireless, always-on technological grid if people understood how easily synthetic fields interact with the human biofield—and how to protect their own energetic sovereignty.\n\nSo the truth was hidden… then sold back to us as wearables and external authority.\n\nThis is why I created the Biofield Mastery Training.\n\nNot to give you something to rely on but to show you how your own system works.\n\nHow to strengthen your biofield.\nHow to regulate it.\nHow to reclaim sovereignty over your energy.\n\nOnce and for all",
        "likes": 1112,
        "comments": 242,
        "views": 8675,
        "date": "2026-01-19T13:40:11-05:00",
        "url": "https://www.instagram.com/p/DTs6RdiD0zQ/",
        "shortcode": "DTs6RdiD0zQ"
      }
    },
    "DTZTZmMkUBR": {
      "account": "@nuatlantis",
      "downloaded_at": "2026-01-24T09:50:42.280548",
      "metadata": {
        "caption": "Comment “AURA” if your ready to develop it and take back your destiny \n\nOur Aura is powdered by the electrical currents running through our body at the atomic, molecular, and cellular level combined with the field of magnetism surrounding us that holds our thoughts, experiences and emotions. \n\nElectricity is the Power \n\nMagnetism is the Information \n\nWalter Russell shows us that the periodic table of elements which make up everything from our bodies to the universe, are only one substance whose final expression is determined only by a pressure differential of compression and expansion waves (+\\- charges) determining whether it becomes silica, gold, iron etc..the dance of generation and degeneration, of growth and decay..\n\nLook deep enough and you will discover essentially magnetic and electric forces not only hold our physical world together, they are the very forces that allow us to experience this world in the first place via the electromagnetic spectrum….everything we see, smell, taste, hear, and touch. \n\nAll of it are electromagnetic signals of standing waves interpreted by our senses\n\nAll ebbing and flowing, Attracting and repelling, inhaling and exhaling, compressing and expanding through the aether folding back in on itself….oscillating between day and night, hot and cold, life and death. \n\nIn an infinite feedback loop between creator and creation. A process found at every level of existence from atoms to solar systems\n\nYou are no different & your Biofield is at the heart of it all \n\nThe key to health, wealth, & divinity\n\nComment “AURA” if your ready to develop it and take back your destiny",
        "likes": 515,
        "comments": 103,
        "views": 2699,
        "date": "2026-01-11T22:38:40-05:00",
        "url": "https://www.instagram.com/p/DTZTZmMkUBR/",
        "shortcode": "DTZTZmMkUBR"
      }
    },
    "DTRQM6xAS7Z": {
      "account": "@nuatlantis",
      "downloaded_at": "2026-01-24T09:50:44.849721",
      "metadata": {
        "caption": "The Science Behind the Spiral Water Channel at Nilkanth Mahadev Temple\n\nWhat looks like a simple, beautiful spiral is actually applied physics, hydrology, and acoustic engineering, encoded into stone centuries ago.\n\nThis shape with its  counterclockwise vs clockwise pattern mimics the flow of electromagnetism…the Torus field.\n\nIt’s the perfect example of bio mimicry at play. \n\nAs Viktor Schauberger famously said…“Comprehend and copy Nature.”\n\nLets dive deeper into the spiral and how this is genius \n \nAs water curves inward it creates micro-vortices along the walls. These vortices entrain air, naturally oxygenating the water.\n\nOxygenated water resists stagnation and microbial imbalance.\n\nThis is the same reason whirlpools, mountain streams, and vortex fountains are considered “living water.”\n\nNature uses this exact principle in vortices, shells, galaxies, and blood flow.\n\nModern systems prioritize speed and extraction while Ancient systems prioritized harmony, efficiency, and longevity, requiring zero inputs.\n\nRegenerative engineering at its finest.\n\nThis is also the exact coil design used for SBB coils  in orgonite to harmonize chaotic energies\n\nThe further you look back the more obvious it is to see how far we have falling from grace\n\nId say it’s about time we remember and begin to reimagine a world where applied science meets internal gnosis\n\nWho’s with me?\n\nRepost @snapture_7",
        "likes": 3309,
        "comments": 64,
        "views": 67030,
        "date": "2026-01-08T19:38:34-05:00",
        "url": "https://www.instagram.com/p/DTRQM6xAS7Z/",
        "shortcode": "DTRQM6xAS7Z"
      }
    },
    "DTO2on9CXhc": {
      "account": "@nuatlantis",
      "downloaded_at": "2026-01-24T09:50:47.022072",
      "metadata": {
        "caption": "Red light vs Blue light\n\nLight doesn’t just let you see…..It tells your body what state to live in.\n\nSantos Bonacci explains this through blue shift and red shift inside the toroidal fields that generate matter and sustain life\n\nBlue shift is compression.\nIt has a Higher frequency.\nBecomes Electric dominant & triggers the sympathetic nervous system of ACTION\n\nRed shift is expansion.\nIt has a Lower frequency.\nBecomes magnetic dominant & stimulates the parasympathetic nervous system of REST\n\nNow REMEMBER the caption in my last post?\n\nHow architecture from the old world, patterns, and symmetry create relaxation and reception…insight…inner guidance.\n\nWhile chaotic disordered environments of today create stress, over stimulation, and trigger the sympathetic nervous system of fight or flight? \n\nOnly when we are in a receptive state can we receive divine inspiration. Self guided \n\nOnly when we are in a reactive/action state do we find ourselves more susceptible to outside control. Guided by others\n\nWe are seeing the same patterns with our current technology \n\nOne look and you can sense it doesn’t  feel right… you’re not crazy\n\nYet when people are running around stressed, anxious, and neurotic our answer is to drug them. \n\nIn the age where everyone wants to talk about mental health at what point are we going to talk about the causative elephant in the room? \n\nKeep following along for the solutions because we haven’t even had breakfast yet…\n\n*Hint : we have everything we need right now for a better world\n\nRepost @the_conscious_awakening",
        "likes": 5546,
        "comments": 189,
        "views": 53588,
        "date": "2026-01-07T21:25:16-05:00",
        "url": "https://www.instagram.com/p/DTO2on9CXhc/",
        "shortcode": "DTO2on9CXhc"
      }
    },
    "DTG_AnpAbNS": {
      "account": "@nuatlantis",
      "downloaded_at": "2026-01-24T09:50:52.997874",
      "metadata": {
        "caption": "This is what they meant when they said your body is a temple\n\nThe hermetic caduceus represents the charging and discharging currents in the human body. Think of it as the (+) and (-) terminals on a battery. \n\nThe real reason why its the symbol of medicine and health…\n\nWhenever a current flows it carries a field of magnetism…the information field that instructs the energy where to go. \n\nThe stronger the current the stronger the field.\n\nThe stronger your field is the more information your energy has access to. \n\nIt creates a perpetual regenerating self sustaining loop …what we call healing \n\nCharge is what powers the whole system. \n\nYou get electrical charge from your emotions, thoughts, senses, & actions. \n\nWhen these are in alignment there is no impedance, charge flows without obstruction. \n\nAll of the atoms, molecules, and cells that make up your body are powered by electricity and communicate wirelessly through the individual fields they emit. \n\nEach field is produced by the oscillating charge which acts like the tone or pitch of a musical note….from the atomic to the cellular level if its oscillating/vibrating too fast or too slow its out of tune….\n\nThe oscillation gives it the pitch, the charge gives it the oscillation and the magnetic field that accompanies, carries the sheet music that allows all the parts to work cohesively like a symphonic orchestra. \n\nThis information has been hidden from public knowledge for over a century.\n\nComment “Biofield” if you’re ready to discover why",
        "likes": 5650,
        "comments": 566,
        "views": 44585,
        "date": "2026-01-04T19:41:58-05:00",
        "url": "https://www.instagram.com/p/DTG_AnpAbNS/",
        "shortcode": "DTG_AnpAbNS"
      }
    },
    "DTHWld0keJC": {
      "account": "@nuatlantis",
      "downloaded_at": "2026-01-24T09:50:56.281651",
      "metadata": {
        "caption": "Mercury Liquid Motor….🤔🤔🤔\n\nRepost @macrocosmmonochronismmechanism \n\nAntigravity Motor!? - Rotating Liquid Mercury\n\nLiquid mercury is rotated in experiments primarily by using electric current and magnetic fields, creating a Lorentz force that pushes the conductive liquid in a circular motion, often seen in DIY setups using magnets, conductors (like aluminum wheels or screws), and a DC power source, making it spin rapidly in a vortex.\n\nMotor Explorer @ Motor_Explorer1\n\n#freeenergy #mercury #tesla",
        "likes": 986,
        "comments": 24,
        "views": 13131,
        "date": "2026-01-04T23:04:16-05:00",
        "url": "https://www.instagram.com/p/DTHWld0keJC/",
        "shortcode": "DTHWld0keJC"
      }
    },
    "DTI79hjEuGx": {
      "account": "@nuatlantis",
      "downloaded_at": "2026-01-24T09:50:57.591349",
      "metadata": {
        "caption": "ELohim, ARCHangel, RaphEL, MichaEL, ARCH of the convenient, ARCHetecture, = ELECTRICAL ARCH= Plasma\n\nI woke up today and found out that Bill Donahue (Speaker) has passed when the homie @charlesformosa shared his condolences and memorial Art\n\nIf your not familiar with him, in his classic works Hidden Meanings, Bill Donahue explains that biblical temple language maps directly onto anatomy with Temple meaning the body & Holy Place / Holy of Holies meaning the brain\n\nOnly the “high priest” entering the Holy of Holies symbolized conscious awareness entering the highest center of the mind.\n\nBill showed us that the Bible is not a literal history book but a symbolic guide to awakening higher consciousness. \n\nThrough meditation, symbolism, and inner exploration, he helps us see that the “Kingdom of God is within.”\n\nOne of his most consistent teachings was that Death was the unconsciousness / ignorance & Resurrection was the awakening of the mind\n\nWhen scripture speaks of rising from the dead, Donahue taught it refers to mental and spiritual awakening, not physical reanimation.\n\nWhile he avoided modern jargon, Donahue clearly associated the “Single eye”, “Eye that sees”, “Lamp of the body” with inner perception, centered in the brain.\n\nHe emphasized that true seeing is internal, not sensory. \n\nHe taught that the repeated references to oil (anointing oil, holy oil, lamp oil) Symbolize cerebrospinal fluid Which circulates through the brain and spinal column Nourishing and protecting the nervous system. \n\nTo be “anointed” meant the system was functioning correctly, not that someone was chosen by an external authority.\n\nTruly ahead of his time….rest in power Bill…",
        "likes": 3944,
        "comments": 102,
        "views": 24975,
        "date": "2026-01-05T13:55:28-05:00",
        "url": "https://www.instagram.com/p/DTI79hjEuGx/",
        "shortcode": "DTI79hjEuGx"
      }
    },
    "DTLb8oGD4C0": {
      "account": "@nuatlantis",
      "downloaded_at": "2026-01-24T09:50:59.130248",
      "metadata": {
        "caption": "BIOFIELD SCIENCE - The true foundation to human health & energy healing practices \n\nIf you’re ready to learn what has been hidden from the modern lexicon comment “BIOFIELD” to sign up for the Biofield Mastery Training Program today. \n\nIn the late 1800s and early 1900s, electrotherapy was not fringe science.\n\nIt was taught in major medical schools, published in peer-reviewed journals, and practiced in hospitals across Europe and the United States. Electricity, vibration, and frequency were considered fundamental forces of life.\n\nJohn Ernst Worrell Keely proposed that matter and biology were governed by harmonic vibration. He described disease as a state of disharmony, and health as restored resonance. \n\nHis work influenced early ideas of sympathetic vibration, acoustics, and frequency-based healing, concepts that would later resurface in physics and biology under different names.\n\nGeorges Lakhovsky expanded this framework. His Multi-Wave Oscillator (MWO) was installed in hospitals and clinics throughout the U.S. and Europe. Lakhovsky showed that cells behave as oscillators and that illness reflects disrupted cellular frequencies. \n\nAfter his death in the early 1940s, MWOs were systematically removed from hospitals and his work quietly abandoned.\n\nRoyal Raymond Rife went further, developing optical microscopes capable of visualizing live microorganisms and frequency devices that reportedly destroyed pathogens without harming surrounding tissue. \n\nHis clinical successes were documented, then challenged. Lawsuits, professional pressure, and regulatory shifts ended his practice.\n\nThe turning point came with the Flexner Report, which restructured medical education. Treatments that could not be patented, electricity, vibration, frequency, were removed from curricula. \n\nPharmaceutical chemistry replaced energetic medicine.\n\nWhat was once mainstream medical science was rebranded as quackery.\n\nHistory didn’t disprove electromedicine.\n\nIt erased it.\n\nIf you’re ready to learn what has been hidden from the modern lexicon comment “BIOFIELD” to sign up for the Biofield Mastery Training Program today. \n\nOn SALE for a limited time!",
        "likes": 1012,
        "comments": 76,
        "views": 0,
        "date": "2026-01-06T13:21:01-05:00",
        "url": "https://www.instagram.com/p/DTLb8oGD4C0/",
        "shortcode": "DTLb8oGD4C0"
      }
    }
  },
  "accounts": {
    "@nuatlantis": {
      "downloaded": [
        "DTnzdKij9aV",
        "DTs6RdiD0zQ",
        "DTZTZmMkUBR",
        "DTRQM6xAS7Z",
        "DTO2on9CXhc",
        "DTG_AnpAbNS",
        "DTHWld0keJC",
        "DTI79hjEuGx",
        "DTLb8oGD4C0"
      ],
      "last_scraped": "2026-01-24T09:50:59.130242"
    }
  }
}